console.log('1.Валидная верстка + 10\n2.Верстка семантическая + 20\n3.Вёрстка соответствует макету +48\n4.Требования к css выполнены +12\n5.Интерактивность, реализуемая через css присутствует + 20\nИтого = 110');


console.log('1.Вёрстка соответствует макету. Ширина экрана 768px +24\n2.Вёрстка соответствует макету. Ширина экрана 380px +24\n3.Ни на одном из разрешений до 320px включительно не появляется горизонтальная полоса прокрутки +15\n4.На ширине экрана 380рх и меньше реализовано адаптивное меню +22\nИтого:85')